import discord
import random

client = discord.Client()

@client.event
async def on_ready():
    print('Logged in as')
    print(client.user.name)
    print(client.user.id)
    print('------')

#ちくちく言葉のリスト
ngwords = ["肩書きつけて","肩書き付けて"]

@client.event
async def on_message(message):
    #ちくちく言葉を検知する
    for ngword in ngwords:
        if ngword in message.content:
            # Botを除外
            if client.user != message.author:
                # ぴえん
                xx = ["はじめましての","ハッピーホームの","フェスティバルな","ポケットの","街へいこうよ","無人島の","やって来た","スマホの","卒業したての",
                "100％","アウトドア派の","アグレッシブな","あつまれ","アマチュアの","勢いあまった","粋な","一人前の","いっぱしの","古の","いわゆる","インターネットの","インドア派の","うまれたての","うわさ好きの","おいでよ",
                "オーガニック系の","オーバーアクションな","オフラインの","おもてなし好きの","温室育ちの","オンラインの","オンリーワンの","快活な","隠しきれてない","かけだしの","ガケっぷちの","影の","からにこもった","気ままな","切れ味のいい","金欠の","金欲の",
                "クラフト系の","グローバルな","外道の","現役の","限界の","コスパ重視の","こもれびの","怖がりの","最弱の","サクッと","雑魚の","雑学の","雑食の","雑な","寂しがり屋の","潮時の","自宅の","自由な","週末の","修行中の","趣味程度の","旬の","親切な",
                "捨てられない","スキのない","スマホの","生活感あふれる","世界の","節約家の","早熟な","草食系の","卒業したての","体育会系の","多趣味な","たぬき開発の","旅する","食べごろの","地球に優しい","知識欲の","ちょっぴり","ツイてる","どうぶつの","ときどき",
                "とびだせ","飛べない","トレンディーな","貪欲な","流されやすい","泣きっ面の","なごみ系の","ナシよりの","名もなき","成金の","南国育ちの","二階から","にわか","パーティーの","バえる","はじめましての","発掘された",
                "ハッピーホームの","春生まれの","ハンドメイドの","半人前の","控えめに言って","ピチピチの","人呼んで","ひとり暮らしの","フェスティバルな","双子の","物欲の","不眠不休の","振り切った","フレッシュな","フワっとしてる",
                "文系の","変化を好む","某・","ポケットの","マイペース","またの名は","まだまだ","街へいこうよ","マメな","真夜中の","未熟な","水もしたたる","道なき道を行く","未来の","無人島の","もったいない",
                "持ってる","物知りな","物好きな","ものづくり","森","夜行性","やっと来た","ややウケの","ヤンチャな","ゆるい","ゆるふわ系の","様子見中の","欲深い","蘇った","余裕のない","ローンの","割かし","ワンルームの"
                ]
                yy = ["アーティスト","愛好家","愛され者","アタッカー","生き字引","移住者","一族","妹","一般人","インフルエンサー","エコロジスト","陸マイラー","おじいちゃん","お調子者","弟","おばあちゃん","オバケ",
                "音楽好き","オンライン","ガーデニング好き","会社員","買い物好き","果実","化石","かたわれ","活動家","カブ主","変わり者","関係","感じ","管理人","客","キャンパー","ギャンブラー","筋肉","空気","草","クラッシャー",
                "クリエイター","系","ゲーマー","化身","コーディネーター","小金持ち","ゴミ","コレクター","サーファー","才能","サカナ","サカナ好き","雑貨好き","時期","仕切り屋","シャイ",
                "社会人","写真好き","自由人","趣味人","消費者","食生活","職人","女子","初心者","素人","仕分け人","真実","スタイリスト","性格","生活","セミプロ","セレブ","世話好き","掃除人","卒業生","ソルジャー","大黒柱",
                "代表","タイプ","旅人","たまご","民","ダンサー","男子","知識人","チャレンジャー","ツーリスト","釣り師","釣り好き","デコリスト","デザイナー","どうぶつ","島民","ドジっ子","友","友達","トランスフォーマー",
                "鳥","虜","トレーダー","泣き虫","ナシ","何か","兄さん","人気者","姉さん","のんびり屋","パイオニア","廃棄物","はからい","旗振り役","パチンカー","花","パパ","パリピ","番人","人","ファミリー","不安","フィクサー"
                "部員","不死鳥","物欲","フレッシャー","フレンズ","プロデューサー","ペット","冒険家","ボウズ","放浪者","星","ぼっち","マネージャー","ママ","実","身","ミュージシャン","ミリオネア","ムシ","ムシ好き","息子","娘","むらびと",
                "モデル","もようがえ好き","森","盛り上げ役","ヤシ","ユーザー","優等生","有識者","幼虫","予備軍","ライフハッカー","ランナー","ルーキー","レビュワー"
                ]
                xx2 = random.choice(xx)
                yy2 = random.choice(yy)
                
    
                #message.author.mention 追加することでメンションする
                m = message.author.mention + xx2 + yy2
                
                    
                # 該当チャンネルに送信
                await message.channel.send(m)

client.run("NjgyMTk4OTQzMzgzMjg5OTE2.XoQ4SQ.LbP1gD0NSwoY0N6yMbZZ2IrzhBQ")
